Revit 2027 API
BuiltInFailures.MassFailures.AutoGlazingFailed Property
 Failure in Auto-Glazing region computation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AutoGlazingFailed { get; }
Public Shared ReadOnly Property AutoGlazingFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AutoGlazingFailed {
	FailureDefinitionId^ get ();
}
static member AutoGlazingFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace